tutorials/multiphase/interOSFoam/BubbleChannelCa10-5/system/blockMeshDict2D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
 (0 0 0)
 (dx 0 0)
 (0 dy 0)
 (dx dy 0)

 (0 0 1e-6)
 (dx 0 1e-6)
 (0 dy 1e-6)
 (dx dy 1e-6)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (nx ny 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 0 4 6)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (3 1 0 2)
            (5 7 6 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
